---
type: IFCExtrusionCalculatorOptions
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 6
tags: [revit-api, class]
---

# IFCExtrusionCalculatorOptions

`Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | IFCExtrusionCalculatorOptions | 2012 | `public IFCExtrusionCalculatorOptions ( ExporterIFC exporterIFC , IFCExtrusionAxes extrusionAxes , XYZ customAxis , double scale )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | CustomAxis | 2012 | `public XYZ CustomAxis { get ; set ; }` |
| Property | ExtrusionAxes | 2012 | `public IFCExtrusionAxes ExtrusionAxes { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Scale | 2012 | `public double Scale { get ; set ; }` |